package Java.Informatics;

import java.util.Scanner;

public class Task2947 {
    /* Электронные часы - 1
Дано число n. С начала суток прошло n минут.
Определите, сколько часов и минут будут показывать
электронные часы в этот момент.
Программа должна вывести два числа:
количество часов (от 0 до 23) и количество минут (от 0 до 59).
Учтите, что число n может быть больше, чем количество минут в сутках.

Входные данные
Вводится целое число n.

Выходные данные
Выведите ответ на задачу.

Примеры
Входные данные
150
Выходные данные
2 30
Входные данные
1441
Выходные данные
0 1
     */
    public static void main(String[] args) {
        Scanner sc = new Scanner(System.in);
        int n = sc.nextInt();
        n = n % 1440;
        int hours = n / 60;
        int minutes = n % 60;
        System.out.println(hours + " " + minutes);
    }
}
