package Java.Informatics;

import java.util.Scanner;

public class Task1460 {
    /* Суперсдвиг

Дана последовательность из N (1 ≤ N ≤ 100000) целых чисел и
число K (|K| ≤ 100000). Сдвинуть всю последовательность
(сдвиг - циклический) на |K| элементов вправо
если K – положительное и влево если отрицательное.

В данной задаче нельзя использовать дополнительные массивы (списки).
Обратите внимание, что нужно именно преобразовать имеющийся список
и распечатать его целиком, а не создать новый,
даже назвав его тем же самым именем (это возможно в языке Python).

Входные данные
В первой строке дано натуральное число N,
во второй строке N целых чисел, а в последней целое число K.
Все числа во входных данных не превышают 109.

Выходные данные
Требуется вывести полученную последовательность.

Примеры
Входные данные
5
5 3 7 4 6
3
Выходные данные
7 4 6 5 3
     */
    Scanner sc = new Scanner(System.in);


}
